/*
*******************************************************************************
** Name  : klapan_relay.c
** Date  : 01.04.2023
** By    : I.Zaicev
** Notes :
*******************************************************************************
*/
#include "klapan_relay.h"


/*
*******************************************************************************
**                        Variables
*******************************************************************************
*/

/*$PAGE$*/
/*
*******************************************************************************
** Description : »нициализаци€ пина, дл€ управлением реле насоса
** Parameter   : none
** Return      : none
** Notes       : KL1 -> PD7, KL2 -> PD6, KL3-> PD5, KL4-> PD4,
**               KL5 -> PD3, KL6 -> PD2, KL7-> PB7, KL8-> PB6,
**               KL9 -> PB5, KL_H -> PC1, KL_L->  PC3,
*******************************************************************************
*/
void RelayKlapan_Init ( void )
{
	PORTD &= ~( (1 << PORTD7) | (1 << PORTD6) | (1 << PORTD5) | (1 << PORTD4) | (1 << PORTD3) | (1 << PORTD2) );
	DDRD  |= ( (1 << DDRD7) | (1 << DDRD6) | (1 << DDRD5) | (1 << DDRD4) | (1 << DDRD3) | (1 << DDRD2) );
	
	PORTB &= ~( (1 << PORTB7) | (1 << PORTB6) | (1 << PORTB5) );
	DDRB  |= ( (1 << DDRB7) | (1 << DDRB6) | (1 << DDRB5) );
	
	PORTC &= ~( (1 << PORTC3) | (1 << PORTC1) );
	DDRC  |= ( (1 << DDRC3) | (1 << DDRC1) );
}
/*$PAGE$*/
/*
*******************************************************************************
** Description : „итает состо€ние пина подачи напр€жени€
** Parameter   : none
** Return      : 16 битное число. 
**               1 - напр€жение подано
**               0 - напр€жение сн€то
** Notes       : »спользовать дл€ анализа неисправностей
*******************************************************************************
*/
uint16_t RelayKlapan_ReadStatus ( void )
{
	uint16_t status = 0;
	uint8_t  tmp = 0;
	
	tmp    = PIND;
	status = tmp >> 2;
	tmp    = 0;
	
	tmp    = PINB >> 5;
	status = tmp << 6;
	
	if ( bit_is_set ( PINC, PINC1 ) ) {
		sbi ( tmp, 0 );
	} else {
		cbi ( tmp, 0 );
	}
	if ( bit_is_set ( PINC, PINC3 ) ) {
		sbi ( tmp, 1 );
		} else {
		cbi ( tmp, 1 );
	}
	return status;
}

/*$PAGE$*/
/*
*******************************************************************************
** Description :
** Parameter   : none
** Return      : none
** Notes       :
*******************************************************************************
*/
